import * as cg from './chessground/types';

/**
 * 駒ごとの動きを設定します。
 * dxとdyは必ず同じ要素数でなければなりません。
  "1" : {
    key: 1, // 駒ID
    name: "玉", // 駒名
    is_promoted: null, //true: 成り駒、false: 未成り駒、null: 成らず駒
    step: [ // 歩く場合の行先
      [-1, -1, -1, 0, 0, 1, 1, 1], //dx (横の変化量) ※dxとdyは必ず同じ要素数
      [-1, 0, 1, -1, 1, -1, 0, 1]  //dy (縦の変化量)
    ],
    run: [ //走り方向
    ]
  },
*/
export const CHUSHOGI_PIECES: cg.pieceData = {
  "0" : {
    key: 0, //空白
    name: "　",
    promote: null,
  },
  "1" : {
    key: 1, //玉
    name: "玉",
    promote: 0,
    step: [
      [-1, -1, -1, 0, 0, 1, 1, 1],
      [-1, 0, 1, -1, 1, -1, 0, 1]
    ],
  },
  "2" : {
    key: 2, //歩
    name: "歩",
    promote: 101,
    step: [
      [0],
      [1]
    ],
  },
  "3" : {
    key: 3, //香
    name: "香",
    promote: 109,
    run: [
      [0],
      [1],
    ]
  },
  "5" : {
    key: 5, //銀
    name: "銀",
    promote: 107,
    step: [
      [-1, 1, 0, -1, 1],
      [-1, -1, 1, 1, 1]
    ],
  },
  "6" : {
    key: 6, //金
    name: "金",
    promote: 108,
    step: [
      [-1, -1, 0, 0, 1, 1],
      [1, 0, 1, -1, 1, 0]
    ],
  },
  "7" : {
    key: 7, //角
    name: "角",
    promote: 105,
    run: [
      [-1, -1, 1, 1],
      [-1, 1, -1, 1],
    ]
  },
  "8" : {
    key: 8, //飛
    name: "飛",
    promote: 106,
    run: [
      [0, 0, -1, 1],
      [-1, 1, 0, 0],
    ]
  },
  "9" : {
    key: 9, //仲
    name: "仲",
    promote: 110,
    step: [
      [0, 0],
      [-1, 1]
    ],
  },
  "10" : {
    key: 10, //銅
    name: "銅",
    promote: 111,
    step: [
      [0, 0, -1, 1],
      [-1, 1, 1, 1]
    ],
  },
  "11" : {
    key: 11, //豹
    name: "豹",
    promote: 112,
    step: [
      [-1, 1, 0, 0, -1, 1],
      [-1, -1, 1, -1, 1, 1]
    ],
  },
  "12" : {
    key: 12, //盲
    name: "盲",
    promote: 113,
    step: [
      [-1, -1, -1, 0, 1, 1, 1],
      [-1, 0, 1, -1, -1, 0, 1]
    ],
  },
  "13" : {
    key: 13, //酔
    name: "酔",
    promote: 114,
    step: [
      [-1, -1, -1, 0, 1, 1, 1],
      [-1, 0, 1, 1, -1, 0, 1]
    ],
  },
  "14" : {
    key: 14, //鳳
    name: "鳳",
    promote: 115,
    step: [
      [0, 0, -1, 1, -2, -2, 2, 2],
      [-1, 1, 0, 0, -2, 2, -2, 2],
    ],
  },
  "15" : {
    key: 15, //麒
    name: "麒",
    promote: 116,
    step: [
      [-1, 1, -1, 1, 0, 0, -2, 2],
      [-1, -1, 1, 1, -2, 2, 0, 0],
    ],
  },
  "16" : {
    key: 16, //反
    name: "反",
    promote: 117,
    run: [
      [0, 0],
      [1, -1],
    ]
  },
  "17" : {
    key: 17, //横
    name: "横",
    promote: 118,
    step: [
      [0, 0],
      [-1, 1]
    ],
    run: [
      [-1, 1],
      [0, 0],
    ]
  },
  "18" : {
    key: 18, //竪
    name: "竪",
    promote: 119,
    step: [
      [-1, 1],
      [0, 0]
    ],
    run: [
      [0, 0],
      [1, -1],
    ]
  },
  "19" : {
    key: 19, //馬
    name: "馬",
    promote: 120,
    step: [
      [0, 0, -1, 1],
      [-1, 1, 0, 0],
    ],
    run: [
      [-1, -1, 1, 1],
      [-1, 1, -1, 1],
    ]
  },
  "20" : {
    key: 20, //龍
    name: "龍",
    promote: 121,
    step: [
      [1, -1, -1, 1],
      [-1, 1, 1, 1],
    ],
    run: [
      [0, 0, -1, 1],
      [-1, 1, 0, 0],
    ]
  },
  "21" : {
    key: 21, //奔
    name: "奔",
    promote: 0,
    run: [
      [-1, -1, -1, 0, 0, 1, 1, 1],
      [-1, 0, 1, -1, 1, -1, 0, 1]
    ]
  },
  "22" : {
    key: 22, //獅子
    name: "獅",
    promote: 0,
    step: [
      [-1, -1, -1, -1, -1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, -2, -2, -2, -2, -2],
      [-2, -1, 0, 1, 2, -2, -1, 1, 2, -2, -1, 0, 1, 2, -2, -1, 0, 1, 2, -2, -1, 0, 1, 2]
    ],
    second_step: [
      [-1, -1, -1, 0, 0, 0, 1, 1, 1],
      [-1, 0, 1, -1, 0, 1, -1, 0, 1]
    ],
  },
  "101" : {
    key: 101, //と金
    name: "と",
    promote: 0,
    step: [
      [-1, -1, 0, 0, 1, 1],
      [1, 0, 1, -1, 1, 0]
    ],
  },
  "105" : {
    key: 105, //成り馬
    name: "馬",
    promote: 0,
    step: [
      [0, 0, -1, 1],
      [-1, 1, 0, 0],
    ],
    run: [
      [-1, -1, 1, 1],
      [-1, 1, -1, 1],
    ]
  },
  "106" : {
    key: 106, //成り龍
    name: "龍",
    promote: 0,
    step: [
      [-1, 1, -1, 1],
      [-1, -1, 1, 1],
    ],
    run: [
      [0, 0, -1, 1],
      [-1, 1, 0, 0],
    ]
  },
  "107" : {
    key: 107, //白駒
    name: "白",
    promote: 0,
    run: [
      [0, 0, -1, 1],
      [1, -1, 1, 1],
    ]
  },
  "108" : {
    key: 108, //成り竪
    name: "竪",
    promote: 0,
    step: [
      [-1, 1],
      [0, 0]
    ],
    run: [
      [0, 0],
      [1, -1],
    ]
  },
  "109" : {
    key: 109, //成り飛
    name: "飛",
    promote: 0,
    run: [
      [0, 0, -1, 1],
      [-1, 1, 0, 0],
    ]
  },
  "110" : {
    key: 110, //成り酔象
    name: "象",
    promote: 0,
    step: [
      [-1, -1, -1, 0, 1, 1, 1],
      [-1, 0, 1, 1, -1, 0, 1]
    ],
  },
  "111" : {
    key: 111, //成り横
    name: "横",
    promote: 0,
    step: [
      [0, 0],
      [-1, 1]
    ],
    run: [
      [-1, 1],
      [0, 0],
    ]
  },
  "112" : {
    key: 112, //成り角
    name: "角",
    promote: 0,
    run: [
      [-1, -1, 1, 1],
      [-1, 1, -1, 1],
    ]
  },
  "113" : {
    key: 113, //飛鹿
    name: "鹿",
    promote: 0,
    step: [
      [-1, -1, -1, 1, 1, 1],
      [-1, 0, 1, -1, 0, 1]
    ],
    run: [
      [0, 0],
      [1, -1],
    ]
  },
  "114" : {
    key: 114, //太子
    name: "太",
    promote: 0,
    step: [
      [-1, -1, -1, 0, 0, 1, 1, 1],
      [-1, 0, 1, -1, 1, -1, 0, 1]
    ],
  },
  "115" : {
    key: 115, //奔王
    name: "奔",
    promote: 0,
    run: [
      [-1, -1, -1, 0, 0, 1, 1, 1],
      [-1, 0, 1, -1, 1, -1, 0, 1]
    ]
  },
  "116" : {
    key: 116, //獅子
    name: "獅",
    promote: 0,
    step: [
      [-1, -1, -1, -1, -1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, -2, -2, -2, -2, -2],
      [-2, -1, 0, 1, 2, -2, -1, 1, 2, -2, -1, 0, 1, 2, -2, -1, 0, 1, 2, -2, -1, 0, 1, 2]
    ],
  },
  "117" : {
    key: 117, //鯨鯢
    name: "鯨",
    promote: 0,
    run: [
      [0, 0, -1, 1],
      [1, -1, -1, -1],
    ]
  },
  "118" : {
    key: 118, //奔猪
    name: "猪",
    promote: 0,
    run: [
      [-1, -1, -1, 1, 1, 1],
      [-1, 0, 1, -1, 0, 1],
    ]
  },
  "119" : {
    key: 119, //飛牛
    name: "牛",
    promote: 0,
    run: [
      [-1, 0, -1, 1, 0, 1],
      [-1, -1, 1, -1, 1, 1],
    ]
  },
  "120" : {
    key: 120, //角鷹
    name: "鷹",
    promote: 0,
    step: [
      [0, 0],
      [1, 2]
    ],
    run: [
      [-1, -1, 0, -1, 1, 1, 1],
      [-1, 0, -1, 1, -1, 0, 1],
    ]
  },
  "121" : {
    key: 121, //飛鷲
    name: "鷲",
    promote: 0,
    step: [
      [-1, 1, -1, 1],
      [1, 1, 2, 2]
    ],
    run: [
      [-1, -1, 0, 1, 1, 0],
      [-1, 0, -1, -1, 0, 1],
    ]
  },
};

/**
 * 2回移動を行う場合の駒の動きを規定します。
 * 獅子の動きは単純に2回行動(second_move_type: 1)なのに対し、飛鷲と角鷹は同じ方向に2歩分進む動きとなり、
 * 1回目の動きによって進めるマスが変化する。(second_move_type: 2)
*/
export const CHUSHOGI_SECOND_MOVES = {
  "22" : {
  },
  "116" : {
    step: [
      [-1, -1, -1, 0, 0, 1, 1, 1],
      [-1, 0, 1, -1, 1, -1, 0, 1]
    ],
  },
  "120" : {
    step: [
      [0, 0],
      [-1, 1]
    ],
  },
  "121" : {
    step: [
      [0, 0],
      [-1, 1]
    ],
  },
};
